1.Write a python program to implement List-to-Series Conversion.

In [1]:
import pandas as pd

my_list = [10, 20, 30, 40, 50]

my_series = pd.Series(my_list)

print(my_series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

2.Write a python program to Generate the series of dates from 1st May, 2021 to 12th 
May, 2021

In [2]:
import pandas as pd

date_series = pd.date_range(start='2021-05-01', end='2021-05-12')

for date in date_series:
    print(date.date())

2021-05-01
2021-05-02
2021-05-03
2021-05-04
2021-05-05
2021-05-06
2021-05-07
2021-05-08
2021-05-09
2021-05-10
2021-05-11
2021-05-12

3.Given a dictionary, convert it into corresponding dataframe and display it.

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

4. Given a 2D List, convert it into corresponding dataframe and display it.

In [4]:
data = [
    ['Alice', 25, 'New York'],
    ['Bob', 30, 'Los Angeles'],
    ['Charlie', 35, 'Chicago']
]
df = pd.DataFrame(data, columns=['Name', 'Age', 'City'])
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

5. Given a CSV file, read it into a dataframe and display it.

In [5]:
csv_file_path = 'day.csv'

df = pd.read_csv(csv_file_path)
print(df)

    Numeric  Numeric-2 Numeric-Suffix
0         1          1            1st
1         2          2            2nd
2         3          3            3rd
3         4          4            4th
4         5          5            5th
5         6          6            6th
6         7          7            7th
7         8          8            8th
8         9          9            9th
9        10         10           10th
10       11         11           11th
11       12         12           12th
12       13         13           13th
13       14         14           14th
14       15         15           15th
15       16         16           16th
16       17         17           17th
17       18         18           18th
18       19         19           19th
19       20         20           20th
20       21         21           21st
21       22         22           22nd
22       23         23           23rd
23       24         24           24th
24       25         25           25th
25       26         26           26th
26       27         27           27th
27       28         28           28th
28       29         29           29th
29       30         30           30th
30       31         31           31st

6. Given a dataframe, sort it by multiple columns.

In [6]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 25, 35, 30],
    'Score': [85, 90, 95, 88, 90]
}

df = pd.DataFrame(data)
sorted_df = df.sort_values(by=['Age', 'Score'], ascending=[True, False])

print(sorted_df)

      Name  Age  Score
2  Charlie   25     95
0    Alice   25     85
1      Bob   30     90
4      Eve   30     90
3    David   35     88

7. Given a dataframe with custom indexing, convert and it to default indexing and 
display it.

In [7]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35]
}
custom_index = ['a', 'b', 'c']
df = pd.DataFrame(data, index=custom_index)

print("Original DataFrame with custom index:")
print(df)

df_reset = df.reset_index(drop=True)
print("\nDataFrame after resetting to default index:")
print(df_reset)

Original DataFrame with custom index:
      Name  Age
a    Alice   25
b      Bob   30
c  Charlie   35

DataFrame after resetting to default index:
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

8. Given a dataframe, select first 2 rows and output them.

In [8]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

df = pd.DataFrame(data)

first_two_rows = df.head(2)
print(first_two_rows)

    Name  Age         City
0  Alice   25     New York
1    Bob   30  Los Angeles

9. Given is a dataframe showing name, occupation, salary of people. Find the average 
salary per occupation.

In [9]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Occupation': ['Engineer', 'Doctor', 'Engineer', 'Doctor', 'Artist'],
    'Salary': [70000, 120000, 80000, 130000, 50000]
}

df = pd.DataFrame(data)

avg_salary = df.groupby('Occupation')['Salary'].mean()

print("Average Salary per Occupation:")
print(avg_salary)

Average Salary per Occupation:
Occupation
Artist       50000.0
Doctor      125000.0
Engineer     75000.0
Name: Salary, dtype: float64

10. Given a dataframe with NaN Values, fill the NaN values with 0.

In [10]:
import numpy as np

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, np.nan, 35, np.nan],
    'Salary': [70000, 80000, np.nan, 90000]
}

df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

df_filled = df.fillna(0)

print("\nDataFrame after filling NaN with 0:")
print(df_filled)

Original DataFrame:
      Name   Age   Salary
0    Alice  25.0  70000.0
1      Bob   NaN  80000.0
2  Charlie  35.0      NaN
3    David   NaN  90000.0

DataFrame after filling NaN with 0:
      Name   Age   Salary
0    Alice  25.0  70000.0
1      Bob   0.0  80000.0
2  Charlie  35.0      0.0
3    David   0.0  90000.0

11. Given is a dataframe showing Company Names (cname) and corresponding Profits 
(profit). Convert the values of Profit column such that values in it greater than 0 are 
set to True and the rest are set to False.

In [11]:
data = {
    'cname': ['Company A', 'Company B', 'Company C', 'Company D'],
    'profit': [5000, -2000, 0, 3000]
}

df = pd.DataFrame(data)

df['profit'] = df['profit'] > 0

print(df)

       cname  profit
0  Company A    True
1  Company B   False
2  Company C   False
3  Company D    True

12. Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee 
Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID 
(eid) and designation of the employee (designation). Output the Dataframe containing 
Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position 
(position).

In [12]:
df1 = pd.DataFrame({
    'eid': [101, 102, 103, 104],
    'ename': ['Alice', 'Bob', 'Charlie', 'David'],
    'stipend': [5000, 6000, 5500, 5800]
})

df2 = pd.DataFrame({
    'eid': [101, 102, 103, 104],
    'designation': ['Manager', 'Analyst', 'Developer', 'Designer']
})

merged_df = pd.merge(df1, df2, on='eid')

merged_df.rename(columns={'designation': 'position'}, inplace=True)

print(merged_df)

   eid    ename  stipend   position
0  101    Alice     5000    Manager
1  102      Bob     6000    Analyst
2  103  Charlie     5500  Developer
3  104    David     5800   Designer